In [1]:
#Import libraries
import pandas as pd

In [2]:
dict1 = {'name':["Alex", "John", "Bob", "Mike","Tim","Jake","Clark"],
        'weight': [50, 53, 45, 48,56,52,53],
        'rollno':[1, 2, 3, 4,5,6,7]}
 
student_wt = pd.DataFrame(dict1)
print(student_wt.head())

   name  weight  rollno
0  Alex      50       1
1  John      53       2
2   Bob      45       3
3  Mike      48       4
4   Tim      56       5

In [3]:
dict2 = {'name':["John","Alex", "Bob", "Mike","Tim","Jerry"],
         'height': [140, 156, 158, 152,153,150],
         'age':[10,11,9,12,11,12],
         'rollno':[2, 1, 3, 4,5,7]}
student_ht = pd.DataFrame(dict2)
print(student_ht.head(6))

    name  height  age  rollno
0   John     140   10       2
1   Alex     156   11       1
2    Bob     158    9       3
3   Mike     152   12       4
4    Tim     153   11       5
5  Jerry     150   12       7

In [4]:
#Using pd.concat

In [5]:
student_conct = pd.concat([student_wt,student_ht])
student_conct.head()

   name  weight  rollno  height  age
0  Alex    50.0       1     NaN  NaN
1  John    53.0       2     NaN  NaN
2   Bob    45.0       3     NaN  NaN
3  Mike    48.0       4     NaN  NaN
4   Tim    56.0       5     NaN  NaN

In [6]:
df4 = pd.concat([student_wt,student_ht],axis=1)

In [11]:
df4.head()

   name  weight  rollno  name  height   age  rollno
0  Alex      50       1  John   140.0  10.0     2.0
1  John      53       2  Alex   156.0  11.0     1.0
2   Bob      45       3   Bob   158.0   9.0     3.0
3  Mike      48       4  Mike   152.0  12.0     4.0
4   Tim      56       5   Tim   153.0  11.0     5.0

In [13]:
#pd.merge()

In [17]:
student_mrg1 = pd.merge(student_wt,student_ht)

In [18]:
student_mrg1

   name  weight  rollno  height  age
0  Alex      50       1     156   11
1  John      53       2     140   10
2   Bob      45       3     158    9
3  Mike      48       4     152   12
4   Tim      56       5     153   11

In [20]:
#same columns

In [7]:
student_mrg2 = pd.merge(student_wt,student_ht, on = ['rollno','name'])

In [8]:
student_wt

    name  weight  rollno
0   Alex      50       1
1   John      53       2
2    Bob      45       3
3   Mike      48       4
4    Tim      56       5
5   Jake      52       6
6  Clark      53       7

In [9]:
student_ht

    name  height  age  rollno
0   John     140   10       2
1   Alex     156   11       1
2    Bob     158    9       3
3   Mike     152   12       4
4    Tim     153   11       5
5  Jerry     150   12       7

In [26]:
#Merged data

In [10]:
print(student_mrg2)

   name  weight  rollno  height  age
0  Alex      50       1     156   11
1  John      53       2     140   10
2   Bob      45       3     158    9
3  Mike      48       4     152   12
4   Tim      56       5     153   11

In [27]:
#Left join

In [12]:
student_mrg3 = pd.merge(student_wt,student_ht, on = ['rollno','name'],how ='left')

In [13]:
student_mrg3

    name  weight  rollno  height   age
0   Alex      50       1   156.0  11.0
1   John      53       2   140.0  10.0
2    Bob      45       3   158.0   9.0
3   Mike      48       4   152.0  12.0
4    Tim      56       5   153.0  11.0
5   Jake      52       6     NaN   NaN
6  Clark      53       7     NaN   NaN

In [ ]:
#Right join

In [15]:
student_mrg4 = pd.merge(student_wt,student_ht, on = ['rollno','name'],how ='right')

In [16]:
student_mrg4

    name  weight  rollno  height  age
0   Alex    50.0       1     156   11
1   John    53.0       2     140   10
2    Bob    45.0       3     158    9
3   Mike    48.0       4     152   12
4    Tim    56.0       5     153   11
5  Jerry     NaN       7     150   12

In [17]:
#outer join

In [21]:
student_mrg5 = pd.merge(student_wt,student_ht, on = ['rollno','name'],how ='outer')

In [22]:
student_mrg5

    name  weight  rollno  height   age
0   Alex    50.0       1   156.0  11.0
1   John    53.0       2   140.0  10.0
2    Bob    45.0       3   158.0   9.0
3   Mike    48.0       4   152.0  12.0
4    Tim    56.0       5   153.0  11.0
5   Jake    52.0       6     NaN   NaN
6  Clark    53.0       7     NaN   NaN
7  Jerry     NaN       7   150.0  12.0

In [23]:
#Export

In [24]:
student_mrg5.to_csv('student_mrg5.csv')